# Математичі операції в Пайтоні:
#
# +  - додавання
# -  - віднімання
# *  - множення
# /  - ділення
# // - цілочисленне діленя
# ** - піднесення до степеня  або за допомогою функції pow()
# % - залишок після ділення

# print(pow(10, 2))  # піднесення числа 10 до степеня 2,результат 100
# print(11 % 2)  # функція % шукає найближе число яке ділиться на задане число і вертає залишок
# print(7 // 3)  # функція // при діленні виводить ціле число і заокруглює до меншого(2.6 = 2)


# +=   Поповнює величину до певного значеня
# -=   Вінімає велечину від певного значення
# *=
# /=
# //=
# **=
# %=


# функція round() при діленні заокруглює число, якщо число більше половини то до вищого,
#                 якщо нижче то до нижчого

# print(round(10.3))  # заокруглення до меншого
# print(round(10.6))  # заокруглення до більшого тому що більше ніж половина

