Змінна - це комірка памяті яка зберігає інформацію
name = "Oleg"

Коментування коду - це пояснення його роботи
name = "Ivan"  # ми створили змінну та присвоїли їй значення Іван

Код закоментовується для того щоб він не виконувався
# print("Andrew")
# print(25)
Для цього використовується комбінація клавіш CTRL + Слеш(/)

Функція яка виводить значення в консоль - print
print("Example")

Функція яка приймає значення від користувача з консолі - input()
Спочатку ми створюємо змінну а потім їй присвоюємо функцію - input()

name = input("Введіть ваше ім'я:")

Конгадинаці строк це процес обєднання різних елементів в одну строку
print("Привіт,мене звати:", name, "мені", age, "років,я живу в:", town)