str - Тип даних який є строкою ("Andrew")
int - тип даних який є числом (25)
float - тип даних який є числом з плаваючою точкою (2.2)
boolean - тип даних який представляє істину або не правду (True False)


type - функція яка повертає тип даних обєкта

line = 1
print(type(line))

функція input() по стандарту приймає тип даних str

у індекс починається 0
name = "Andrew"
print(name[0])

name = "Andrew"
print(name[1:4])  # викликаємо букви які мають індекси від 1-4

індекс -1 це остання буква

name = "Andrew"
print(name[-3:]) # від букви з індексом -3 до кінця

