# if - за допомогою if створюємо умову,
# якщо ця умова буде вірною то спрацьовує блок коду який знаходиться нижче,в іншому випадку
# код не працюватиме

# приклад:

# a = 12,
# b = 5
# if a > b:
    #print(a, " більше за ", b)

# elif - це додаткова умова яка працює так само як if, тобто якщо нам потрібно вказати більш ніж 2
# умови то використовуємо elif, але ця команда не може працювати без if

# a = 12
# b = 5
# if a > b:
     #print(a, "більше за ", b)
# elif a == b:
    #print("числа одинакові")


# else - ця команда виконується тоді коли потрібно вказати всі інші ситуації крім
# тих які ми вказали за допомогою if, elif, команда не працює без if


# a = 12
# b = 5
# if a > b:
     #print(a, "більше за ", b)
# elif a == b:
    #print("числа одинакові")
# else:
    #print(b, " більше за ", a)