# В країні Індонезії проводять перепис населення,
# але зрозуміли, що це займає дуже багато часу. Нам потрібно описати код,
# який добавляє імена людей в певний список, продумати логічну
# умову зупинки яка буде зручна користувачові ПО. Також якщо введене імя
# має менше трьох букв то ми його видаляємо з фінального списки.
# В кінці програми користувачеві
# дається вибір чи отримати індекс людини в цьому списку чи завершити роботу.


# objects = []
#
# while True:
#     names = input("Введіть ім'я: ")
#     if names == "0":
#         break
#     objects.append(names)
#
# for i in objects:
#     if len(i) <= 3:
#         objects.remove(i)
# print(objects)
#
# word = input("Ви хочете дізнатися індекс певної людини?, Yes / No ")
# if word == "Yes":
#     name = input("Введіть ім'я: ")
#     print(objects.index(name))
# elif word == "No":
#     print("Дякую за роботу, до наступної зустрічі")




