# Написати функцію яка повертає
# значення True якщо число входить в проміжок
# від 0 о 10 і повертає False якщо число менше 0


# def number(x):
#     if 0 < x < 10:
#         return True
#     else:
#         return False


# Написати функцію яка приймає параметрами по стандарту
# age and name і задає їм стандартні значення age = 18,
# name = Vasil в функції за бажанням користувач має можливість
# змінити значення змінних або вивести результат з значеннями по стандарту.


# def test(age=18, name="Vasil"):
#     text = input("Чи бажаєте змінити значення змінних? ")
#     if text == "так":
#         age = int(input("Задайте інший вік: "))
#         name = input("Напишіть інше ім'я: ")
#         return age, name
#     else:
#         return age, name


# print(test())


# Описати функцію яка обчислує скільки
# років потрібно людині для виходу на пенсію. Якщо пенсійний вік = 65 років.


# age = int(input())
#
#
# def function(x):
#     if x > 65:
#         return "Ви уже на пенсії"
#     else:
#         return f"До виходу на пенсію вам залишилось - {65 - x} років"
#
#
# print(function(age))


# Ціна оренди квартири становить 8000 за місяць але після зміни контракту ціна встановлена
# на рівні 12000, описати функціїї які обчислють плату за рік в обох випадках.


# def rent(x):
#     return f"Ціна за рік буде {x * 12}"
#
#
# def rent2(j):
#     return f"Ціна за рік буде {j * 12}"
#
#
# print(rent(8000))
# print(rent2(12000))


# Описати функцію яка приймає слово і максимальну кількість дозволених літер в слові.
# Якщо слово проходить валідацію (кількість букс в слові < максимальна кількість букв)
# то повертається значення True а в іншому випадку значення False.


# def validation(x, letters):
#     if len(x) > letters:
#         return True
#     else:
#         return False
#
#
# print(validation("ira", 5))

# IT девелопер працює на дві компанії одночасно
# і отримує дві зарплатні, підрахувати скільки в загальному
# в нього прибуток. Варто врахувати, що податок на отримання коштів становить 5%.


# def salary(salary_one, salary_two):
#     return salary_one + salary_two - ((salary_one + salary_two) * 0.05)
#
#
# print(salary(1000, 500))


# Акції компанії Google становлять
# 100,000,000$ підрахувати скільки коштують 2% акцій компанії.

# def google(x):
#     return x * 0.02
#
#
# print(google(100_000_000))







