# Написати функцію яка повертає
# значення True якщо число входить в проміжок
# від 0 о 10 і повертає False якщо число менше 0


# def number(x):
#     if 0 < x < 10:
#         return True
#     else:
#         return False


# Написати функцію яка приймає параметрами по стандарту
# age and name і задає їм стандартні значення age = 18,
# name = Vasil в функції за бажанням користувач має можливість
# змінити значення змінних або вивести результат з значеннями по стандарту.


# def test(age=18, name="Vasil"):
#     text = input("Чи бажаєте змінити значення змінних? ")
#     if text == "так":
#         age = int(input("Задайте інший вік: "))
#         name = input("Напишіть інше ім'я: ")
#         return age, name
#     else:
#         return age, name


# print(test())


# Описати функцію яка обчислує скільки
# років потрібно людині для виходу на пенсію. Якщо пенсійний вік = 65 років.


# age = int(input())
#
#
# def function(x):
#     if x > 65:
#         return "Ви уже на пенсії"
#     else:
#         return f"До виходу на пенсію вам залишилось - {65 - x} років"
#
#
# print(function(age))


# Ціна оренди квартири становить 8000 за місяць але після зміни контракту ціна встановлена
# на рівні 12000, описати функціїї які обчислють плату за рік в обох випадках.


# def rent(x):
#     return f"Ціна за рік буде {x * 12}"
#
#
# def rent2(j):
#     return f"Ціна за рік буде {j * 12}"
#
#
# print(rent(8000))
# print(rent2(12000))


# Описати функцію яка приймає слово і максимальну кількість дозволених літер в слові.
# Якщо слово проходить валідацію (кількість букс в слові < максимальна кількість букв)
# то повертається значення True а в іншому випадку значення False.


# def validation(x, letters):
#     if len(x) > letters:
#         return True
#     else:
#         return False
#
#
# print(validation("ira", 5))

# IT девелопер працює на дві компанії одночасно
# і отримує дві зарплатні, підрахувати скільки в загальному
# в нього прибуток. Варто врахувати, що податок на отримання коштів становить 5%.


# def salary(salary_one, salary_two):
#     return salary_one + salary_two - ((salary_one + salary_two) * 0.05)
#
#
# print(salary(1000, 500))


# Акції компанії Google становлять
# 100,000,000$ підрахувати скільки коштують 2% акцій компанії.

# def google(x):
#     return x * 0.02
#
#
# print(google(100_000_000))


# Автомобіль Volvo бере 12
# літрів на 100 км. Підрахувати скільки він бере на <n> км.


# def volvo_km(n):
#     km_litr = 100 / 12
#     return f"Volvo бере {round(n / km_litr)} літрів на {n} км"
#
#
# print(volvo_km(200))


# 2 )
# Ціна одного саженця дерева = 100 грн. Але після подорожання ціна становить 110 грн.
# Підрахувати скільки коштує посадити <n> дерев до подорожання і після.


# def tree(n):
#     return f"Посадити {n} дерев до подорожання коштує {n * 100} грн"
#
#
# def tree2(n):
#     return f"Посадити {n} дерев після подорожання коштує {n * 110} грн"
#
#
# print(tree(10))
# print(tree2(10))


# 3)
# Функція nam приймає параметр
# info (це буде ліст елементів), вона повертає перших три його елементи.
# Вивести їх.


# def num(info):
#     for i in info[:3]:
#         yield i
#
#
# print(*num([1, 2, 3, 4, 5, 7, 8, 10]))


# Написати функцію яка проганяє ліст елементів
# та множить кожне його значення на 10


# def power(lst):
#     for i in lst:
#         yield i * 10
#
#
# print(*power([1, 2, 3, 4, 5, 6, 7]))


# Написати функцію яка проганяє ліст елементів та
# множить кожне його значення на число n(від користувача). Та написати іншу
# функцію яка приймає генератор першої функції та конвертує його до типу данних list.


# def power_list(lst):
#     n = int(input("Введіть число: "))
#     for i in lst:
#         yield i * n
#
#
# def convert(generator):
#     return list(generator)
#
#
# print(convert(power_list([1, 2, 3, 4, 5, 6])))



